Revit 2027 API
ExternalCommandsData.ClassName Property
 The name of the class containing the implementation for the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ClassName { get; set; }
Public Property ClassName As String
	Get
	Set
public:
property String^ ClassName {
	String^ get ();
	void set (String^ value);
}
member ClassName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The class name which implements the interface IExternalCommand.
See Also
Reference
ExternalCommandsData Class
Autodesk.Revit.UI Namespace